Repository: damienbod/AspNetCoreID4External
Catalog: src/IdentityServerWithAspNetIdentity/Resources/SharedResource.*.resx
Languages: es_mx, fr_fr, ga_ie

# StoreNotIUserRoleStore
source: Store does not implement IUserRoleStore<TUser>.
es_mx: El almacén no implementa IUserRoleStore<TUser>.
fr_fr: Store n'implémente pas IUserRoleStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserRoleStore<TUser>.

# StoreNotIUserSecurityStampStore
source: Store does not implement IUserSecurityStampStore<TUser>.
es_mx: El almacén no implementa IUserSecurityStampStore<TUser>.
fr_fr: Store n'implémente pas IUserSecurityStampStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserSecurityStampStore<TUser>.

# StoreNotIUserTwoFactorRecoveryCodeStore
source: Store does not implement IUserTwoFactorRecoveryCodeStore<User>.
es_mx: El almacén no implementa IUserTwoFactorRecoveryCodeStore<User>.
fr_fr: Store n'implémente pas IUserTwoFactorRecoveryCodeStore <Utilisateur>.
ga_ie: Ní fheidhmíonn Store IUserTwoFactorRecoveryCodeStore<User>.

# StoreNotIUserTwoFactorStore
source: Store does not implement IUserTwoFactorStore<TUser>.
es_mx: Almacen no implementa IUserTwoFactorStore<TUser>.
fr_fr: Store n'implémente pas IUserTwoFactorStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserTwoFactorStore<TUser>.

# UserAlreadyHasPassword
source: User already has a password set.
es_mx: El usuario ya tiene configurado una contraseña.
fr_fr: L'utilisateur a déjà défini un mot de passe.
ga_ie: Tá tacar focal faire ag an úsáideoir cheana féin.

# UserAlreadyInRole
source: User already in role '{0}'.
es_mx: Usuario ya pertence al rol '{0}'.
fr_fr: L'utilisateur a déjà le rôle '{0}'.
ga_ie: Úsáideoir cheana féin i ról '{0}'.

# UserLockedOut
source: User is locked out.
es_mx: El usuario está bloqueado.(masculino)
fr_fr: L'utilisateur est bloqué.
ga_ie: Tá an t-úsáideoir faoi ghlas.

# UserLockoutNotEnabled
source: Lockout is not enabled for this user.
es_mx: El bloqueo no está habilitado para este usuario.
fr_fr: Le verrouillage n'est pas activé pour cet utilisateur.
ga_ie: Ní féidir frithdhúnadh a chumasú don úsáideoir seo.

# UserNameNotFound
source: User {0} does not exist.
es_mx: Userio {0} no existe.
fr_fr: L'utilisateur {0} n'existe pas.
ga_ie: Níl Úsáideoir {0} ann.

# UserNotInRole
source: User is not in role '{0}'.
es_mx: El usuario no pertenece al rol '{0}'.
fr_fr: L'utilisateur n'a pas le rôle '{0}'.
ga_ie: Níl an t-úsáideoir '{0}' i ról.

source: Access to your applications and resources, even when you are offline
es_mx: Acceda a sus aplicaciones y recursos, incluso cuando esté desconectado
ga_ie: Rochtain ar d'iarratais agus acmhainní, fiú nuair atá tú as líne

# CONSENT_CONFIRM_AUTH_REQUEST_QUOTES
source: Please confirm that the authorization request quotes the code:
es_mx: Confirme que la solicitud de autorización cita el código:
ga_ie: Deimhnigh, le do thoil, go luaitear an cód leis an iarraidh údaraithe:

# DEVICE_ENTER_CODE_DISPLAYED_ON_DEVICE
source: Please enter the code displayed on your device
es_mx: Por favor ingresa el código mostrado en tú dispositivo
ga_ie: Cuir isteach an cód a thaispeántar ar do ghléas le do thoil

# DEVICE_SUCCESS
source: Success
es_mx: Satisfactorio
ga_ie: Rath

# DEVICE_SUCCESS_AUTHORIZE
source: You have successfully authorized the device
es_mx: Haz autorizado satisfactiriamente el dispositivo
ga_ie: D'éirigh leat an gléas a údarú

# DEVICE_USER_CODE
source: User Code
es_mx: Código de Usuario
ga_ie: Cód Úsáideora

source: Invalid selection
es_mx: Selección inválida
ga_ie: Roghnú neamhbhailí

source: Offline Access
es_mx: Acceso fuera de línea
ga_ie: Rochtain as líne

source: Recovery codes
es_mx: Códigos de recuperación
ga_ie: Cóid aisghabhála

source: User profile
es_mx: Perfil de usuario
ga_ie: Próifíl úsáideora

source: You must pick at least one permission
es_mx: Debes elegir al menos un permiso
ga_ie: Ní mór duit cead amháin ar a laghad a roghnú

source: Your email address
es_mx: Su correo electrónico
ga_ie: Do sheoladh ríomhphoist

source: Your user identifier
es_mx: Su identificador de usuario
ga_ie: Do aitheantóir úsáideora

source: Your user profile information (first name, last name, etc.)
es_mx: La infomación de su perfil de usuario (nombre, apellido , etc.)
ga_ie: Do chuid faisnéise faoi phróifíl úsáideora (an chéad ainm, an t-ainm deireanach, etc.)

# FIDO2_ADD_A_KEY
source: Add a FIDO2 Key
es_mx: Agregar una clave FIDO2
fr_fr: Ajouter une clé FIDO2
ga_ie: Cuir Eochair FIDO2 leis

# FIDO2_COULD_NOT_VERIFY_ASSERTION
source: Could not verify assertion
es_mx: No se pudo verificar la afirmación
fr_fr: Impossible de vérifier l'affirmation
ga_ie: Níorbh fhéidir dearbhú a fhíorú

# FIDO2_LOGIN_WITH_MFA
source: Login with FIDO2 MFA
es_mx: Iniciar con FIDO2 MFA
fr_fr: Se connecter avec FIDO2 MFA
ga_ie: Logáil isteach le FIDO2 MFA

source: FIDO2 Multi-factor authentication
fr_fr: Authentification multifacteur FIDO2
ga_ie: FIDO2 Fíordheimhniú ilfhachtóra

# FIDO2_REGISTRATION_ERROR
source: Could not create credentials in browser. Probably because the username is already registered with your authenticator. Please change username or authenticator.
es_mx: No se pudieron crear credenciales en el navegador. Probablemente porque el nombre de usuario ya está registrado con su autenticador. Por favor, cambie el nombre de usuario o el autenticador.
fr_fr: Impossible de créer l'identité dans le navigateur. Le nom d'utilisateur est probablement déjà enregistré avec votre identificateur. Veuillez changer de nom d'utilisateur ou d'identificateur.
ga_ie: Níorbh fhéidir dintiúir a chruthú sa bhrabhsálaí. Is dócha toisc go bhfuil an t-ainm úsáideora cláraithe le do bharántóir cheana féin. Athraigh ainm úsáideora nó fíordheimhnithe.

# FIDO2_SUPPORTED_BROWSERS
source: Supported browsers
es_mx: Navegadores soportados
fr_fr: Navigateurs supportés
ga_ie: Brabhsálaithe tacaithe

# FIDO2_TAP_YOUR_SECURITY_KEY_TO_FINISH_REGISTRATION
source: Tap your security key to finish registration.
es_mx: Toque su clave de seguridad para finalizar el registro.
fr_fr: Veuillez écrire votre clé de sécurité pour finir l'enregistrement.
ga_ie: Beartaigh do eochair slándála chun clárú a chríochnú.

# FIDO2_TAP_YOUR_SECURITY_KEY_TO_LOGIN
source: Tap your security key to login.
es_mx: Toque su clave de seguridad para iniciar sesión.
fr_fr: Veuillez écrire votre clé de sécurité pour vous connecter.
ga_ie: Beartaigh do eochair slándála chun logáil isteach.

# FIDO2_UNABLE_TO_LOAD_2FA_AUTHENTICATED_USER
source: Unable to load two-factor authenticated user.
es_mx: No se puede cargar el usuario autenticado de doble factore.
fr_fr: Impossible de charger l'utilisateur doublement identifié.
ga_ie: Ní féidir le húsáideoir fíordheimhnithe dhá fhachtóir a luchtú.

# FIDO2_UNKNOWN_CREDENTIALS
source: Unknown credentials
es_mx: Credenciales desconocidas
fr_fr: Identifiants inconnus
ga_ie: Dintiúir anaithnid

# FIDO2_USERNAME
source: Username
es_mx: Nombre de usuario
fr_fr: nom d'utilisateur
ga_ie: Ainm Úsáideora

# FIDO2_USERNAME_NOT_REGISTERED
source: Username was not registered
es_mx: El nombre de usuario no fue registrado
fr_fr: Le nom d'utilisateur n'a pas été enregistré
ga_ie: Níor cláraíodh ainm úsáideora

# FIDO2_USER_NOTFOUND
source: Unable to load user with ID '{0}'.
es_mx: No fue ppsible cargar el usuario ID '{0}'.
fr_fr: Impossible de charger l'utilisateur ayant l'ID '{0}'.
ga_ie: Ní féidir an t-úsáideoir a luchtú le ID '{0}'.

# FIDO2_WEBAUTHN_NOT_SUPPORTED
source: Please note: Your browser does not seem to support WebAuthn yet.
es_mx: Por favor ten en cuenta: Parece que tu navegador todavia no soporta.
fr_fr: Votre navigateur ne semble pas supporter WebAuthn.
ga_ie: Tabhair faoi deara: Is cosúil nach dtacaíonn do bhrabhsálaí le WebAuthn go fóill.

# ERROR_ENABLE_MFA
source: Enable MFA
es_mx: Habilitar MFA
fr_fr: Activer MFA
ga_ie: Cumasaigh MFA

# ERROR_ENABLE_MFA_CLIENT_APP_REQUIRES_MFA
source: The client application requires you to have MFA enabled. Enable this and try to sign in again.
es_mx: La aplicación cliente requiere que tenga habilitado MFA. Habilite esto e intente iniciar sesión nuevamente.
fr_fr: L'application cliente requière l'activation du MFA. Activez cette fonctionalité et réssayez.
ga_ie: Éilíonn an feidhmchlár cliant go bhfuil tú in ann MFA a chumasú. Cumasaigh é seo agus déan iarracht clárú arís.

# ERROR_ENABLE_MFA_ERROR_TITLE
source: Enable MFA Error
es_mx: Habilitar erro MFA
fr_fr: Error lors de l'activation du MFA
ga_ie: Cumasaigh Earráid MFA

# ERROR_ENABLE_MFA_YOU_CAN_ENABLE_HERE
source: You can enable MFA to login here:
es_mx: Puedes habilitar MFA para ingresar aquí:
fr_fr: Vous pouvez activer MFA pour vous connectez ici:
ga_ie: Is féidir leat cur ar chumas MFA logáil isteach anseo:

source: Grants
fr_fr: Permis
ga_ie: Deontais

# GRANTS_API_GRANTS
source: API Grants
fr_fr: Permis API
ga_ie: API Deontais

# GRANTS_CLIENT_APP_ACCESS
source: Client Application Access
es_mx: Acceso a la aplicación cliente
fr_fr: Accès à l'application client
ga_ie: Rochtain ar Iarratas Cliant

# GRANTS_CREATED
source: Created
es_mx: Creada
fr_fr: Créé
ga_ie: Cruthaithe

# GRANTS_EXPIRES
source: Expires
es_mx: Expira
fr_fr: Expire
ga_ie: In éag

# GRANTS_IDENTITY_GRANTS
source: Identity Grants
fr_fr: Approbation d'identité
ga_ie: Deontais Aitheantais

# GRANTS_INFO
source: Below is the list of applications you have given access to and the names of the resources they have access to.
es_mx: A continuación se muestra la lista de aplicaciones a las que ha dado acceso y los nombres de los recursos a los que tiene acceso.
fr_fr: Les applications auxquelles vous avez donné accès et les ressources auxquelles elles ont accès sont données ci-dessous.
ga_ie: Anseo thíos tá liosta na n-iarratas a thug tú rochtain orthu agus ainmneacha na n-acmhainní a bhfuil rochtain acu orthu.

# GRANTS_NO_ACCESS
source: You have not given access to any applications
es_mx: No tienes acceso a ninguna aplicación
fr_fr: Vous n'avez donné l'accès à aucune application.
ga_ie: Níor thug tú rochtain ar aon iarratais

# GRANTS_REVOKE_ACCESS
source: Revoke Access
es_mx: Revocar Acceso
fr_fr: Révoquer l'accès
ga_ie: Cúlghairm a dhéanamh ar Rochtain

source: Email required
es_mx: El correo electrónico es requiredo
fr_fr: Adresse e-mail requise

# PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character.
es_mx: Las contraseñas deben tener al menos un carácter no alfanumérico.
fr_fr: Les mots de passe doivent comporter au moins un caractère non alphanumérique.
