Repository: damienbod/AspNetCoreID4External
Catalog: src/IdentityServerWithAspNetIdentity/Resources/SharedResource.*.resx
Languages: es_mx, fr_fr, ga_ie

# 2FA_STATUS_BROWSER_FORGET
source: The current browser has been forgotten. When you login again from this browser you will be prompted for your 2fa code.
es_mx: El navegador actual ha sido olvidado. Cuando inicie sesión nuevamente desde este navegador, se le solicitará su código 2fa.
fr_fr: Le navigateur actuel a été oublié. Si vous vous reconnectez à partir de ce navigateur, il vous faudra entrer votre code 2FA.
ga_ie: Rinneadh dearmad ar an mbrabhsálaí reatha. Nuair a logálann tú arís ón mbrabhsálaí seo iarrfar ort do chód 2FA a fháil.

source: Authenticator app
es_mx: Aplicación de autenticación
fr_fr: Application Authenticator
ga_ie: Feidhmchlár fíordheimhnithe

source: Delete
es_mx: Eliminar
fr_fr: Effacer
ga_ie: Scrios

source: Download
es_mx: Descargar
fr_fr: Télécharger
ga_ie: Íoslódáil

# EXTERNAL_LOGINS_REGISTERED_LOGIN
source: Registered Logins
es_mx: Inicios de sesión registrados
fr_fr: Inscriptions enregistrées
ga_ie: Logáin Cláraithe

# EXTERNAL_LOGINS_TITLE
source: Manage your external logins
es_mx: Administra tus inicios de sesión externos
fr_fr: Gérez vos connexions externes
ga_ie: Bainistigh do logáil isteach seachtrach

source: Forget this browser
es_mx: Olvidadar este navegador
fr_fr: Oubliez ce navigateur
ga_ie: Déan dearmad ar an mbrabhsálaí seo

source: Generate
es_mx: Generar
fr_fr: Générer
ga_ie: Gin

# GENERATE_2FA_RECOVERY_CODES
source: Generate two-factor authentication (2FA) recovery codes
es_mx: Generar códigos de recuperación de autenticación de doble factor (2FA)
fr_fr: Générez des codes de récupération pour l'authentification à 2 facteurs (2FA)
ga_ie: Cruthaigh cóid aisghabhála dhá fhíordheimhniú (2FA)

# GENERATE_2FA_RECOVERY_CODES_INFO_LOSE
source: If you lose your device and don't have the recovery codes you will lose access to your account.
es_mx: Si pierde su dispositivo y no tiene los códigos de recuperación, perderá el acceso a su cuenta.
fr_fr: Si vous perdez votre appareil et n'avez pas de code de récupération, vous perdez l'accès à votre compte.
ga_ie: Má chailleann tú do ghléas agus mura bhfuil na cóid aisghabhála agat caillfidh tú rochtain ar do chuntas.

# GENERATE_2FA_RECOVERY_CODES_SAFE_PLACE
source: Put these codes in a safe place.
es_mx: Coloca estos códigos en un lugar seguro.
fr_fr: Déposez ces codes dans un endroit sûr.
ga_ie: Cuir na cóid seo in áit shábháilte.

# GENERATE_2FA_RECOVERY_CODES_TEXT
source: Generating new recovery codes does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
es_mx: La generación de nuevos códigos de recuperación no cambia las claves utilizadas en las aplicaciones de autenticación. Si desea cambiar la clave utilizada en una aplicación de autenticación, debe
fr_fr: La création de nouveaux codes de récupération ne modifiera pas les clés utilisées dans les applications Authenticator. Si vous souhaitez modifier la clé utilisée dans une application Authenticator, vous devez réinitialiser votre clé d'authentification.
ga_ie: Ní athraíonn giniúint na gcód aisghabhála nua na heochracha a úsáidtear i apps fíordheimhnithe. Más mian leat an eochair a athrú i app fíoraitheora ba chóir duit

# GENERATE_2FA_RECOVERY_CODES_TEXT_LINK
source: reset your authenticator keys.
es_mx: restablecer sus claves de autenticación.
fr_fr: réinitialiser.
ga_ie: do chuid eochracha fíordheimhnithe a athshocrú.

source: Generate Recovery Codes
es_mx: Generar códigos de recuperación
fr_fr: Générer des codes de récupération
ga_ie: Gin Cóid Téarnaimh

# PERSONAL_DATA_DELETEINFO
source: Deleting this data will permanently remove your account, and this cannot be recovered.
es_mx: Eliminar estos datos eliminará permanentemente su cuenta, y esto no se puede recuperar.
fr_fr: La suppression de ces données entraînera la suppression définitive de votre compte. Cela ne peut pas être restauré.
ga_ie: Má scriostar na sonraí seo bainfear do chuntas go buan agus ní féidir é seo a aisghabháil.

# PERSONAL_DATA_INFO
source: Your account contains personal data that you have given us. This page allows you to download or delete that data.
es_mx: Su cuenta contiene datos personales que nos ha proporcionado. Esta página le permite descargar o eliminar esos datos.
fr_fr: Votre compte contient des données personnelles que vous nous avez fournies. Sur cette page, vous pouvez télécharger ou supprimer ces données.
ga_ie: Tá sonraí pearsanta a thug tú dúinn i do chuntas. Ligeann an leathanach seo duit na sonraí sin a íoslódáil nó a scriosadh.

source: Phone number
es_mx: Número telefónico
fr_fr: Numéro de téléphone
ga_ie: Uimhir teileafón

source: Remove
es_mx: Remover
fr_fr: Effacer
ga_ie: Bain amach

# RESET_AUTHENTICATOR_INFO
source: If you reset your authenticator key your authenticator app will not work until you reconfigure it.
es_mx: Si restablece su clave de autenticación, su aplicación de autenticación no funcionará hasta que la reconfigure.
fr_fr: Lorsque vous réinitialisez votre clé d'authentification, l'application d'authentification ne fonctionnera que lorsque vous l'aurez reconfigurée.
ga_ie: Má athraíonn tú do eochair fíordheimhnithe ní oibreoidh do app fíordheimhnithe go dtí go ndéanfaidh tú é a athchumrú.

source: Reset authenticator key
es_mx: Restablecer clave de autenticador
fr_fr: Réinitialisation la clé d'authentification
ga_ie: Athshocraigh eochair fíordheimhnithe

# RESET_AUTHENTICATOR_STATUS
source: Your authenticator app key has been reset, you will need to configure your authenticator app using the new key.
es_mx: La clave de la aplicación de autenticación se ha restablecido; deberá configurarla con la nueva clave.
fr_fr: Votre clé d'application d'authentification a été réinitialisée. Vous devez configurer votre application d'authentification avec la nouvelle clé.
ga_ie: Athshocraíodh an eochair app do fhíordheimhniú, beidh ort do app fíordheimhnithe a chumrú ag baint úsáide as an eochair nua.

# RESET_AUTHENTICATOR_TEXT
source: This process disables 2FA until you verify your authenticator app. If you do not complete your authenticator app configuration you may lose access to your account.
es_mx: Este proceso deshabilita 2FA hasta que verifique su aplicación de autenticación. Si no completa la configuración de la aplicación de autenticación, puede perder el acceso a su cuenta.
fr_fr: Ce processus désactive 2FA jusqu'à ce que vous ayez vérifié votre application d'authentification. Si vous ne parvenez pas à terminer la configuration de votre application d'authentification, vous risquez de perdre l'accès à votre compte.
ga_ie: Díchumasaíonn an próiseas seo 2FA go dtí go bhfíoraíonn tú do app fíoraitheora. Mura gcomhlánaíonn tú do chumraíocht app fíoraitheora féadfaidh tú rochtain ar do chuntas a chailleadh.

source: Reset recovery codes
es_mx: Restablecer tus códigos de verificación
fr_fr: Réinitialisez les codes de récupération
ga_ie: Athshocraigh cóid aisghabhála

source: Save
es_mx: Guardar
fr_fr: Sauvegarder
ga_ie: Sábháil

source: Send verification email
es_mx: Enviar correo electrónico de verificación
fr_fr: Envoyer un e-mail de vérification
ga_ie: Seol ríomhphost fíoraithe

source: Set password
es_mx: Configurar la contraseña
fr_fr: Définir le mot de passe
ga_ie: Socraigh focal faire

# SET_PASSWORD_STATUS
source: Your password has been set.
es_mx: Su contraseña ha sido establecida.
fr_fr: Votre mot de passe a été défini
ga_ie: Tá do phasfhocal socraithe.

# SET_PASSWORD_TEXT
source: You do not have a local username/password for this site. Add a local account so you can log in without an external login.
es_mx: No tiene un nombre de usuario / contraseña local para este sitio. Agregue una cuenta local para que pueda iniciar sesión sin un inicio de sesión externo.
fr_fr: Vous n'avez pas de nom d'utilisateur / mot de passe local pour cette page. Ajoutez un compte local pour pouvoir vous connecter sans vous connecter en externe.
ga_ie: Níl ainm úsáideora / focal faire áitiúil agat don suíomh seo. Cuir cuntas áitiúil leis ionas gur féidir leat logáil isteach gan logáil isteach seachtrach.

source: Set your password
es_mx: Establece tu contraseña
fr_fr: Définissez un mot de pase
ga_ie: Socraigh do phasfhocal

# STATUS_EXTERNAL_LOGIN_ADDED
source: The external login was added.
es_mx: Se agregó el inicio de sesión externo.
fr_fr: La connexion externe a été ajoutée.
ga_ie: Cuireadh an logáil isteach seachtrach leis.

# STATUS_EXTERNAL_LOGIN_REMOVED
source: The external login was removed.
es_mx: Se eliminó el inicio de sesión externo.
fr_fr: La connexion externe a été supprimée.
ga_ie: Baineadh an logáil isteach seachtrach.

# STATUS_GENERATE_CODES
source: You have generated new recovery codes.
es_mx: Has generado nuevos códigos de recuperación.
fr_fr: Vous avez généré de nouveaux codes de récupération.
ga_ie: Ghin tú cóid nua aisghabhála.

# STATUS_PROFILE_UPDATED
source: Your profile has been updated
es_mx: Tú perfil ha sido actualizado
fr_fr: Votre profil a été actualisé
ga_ie: Nuashonraíodh do phróifíl

# STATUS_UPDATE_PROFILE_EMAIL_SEND
source: Verification email sent. Please check your email.
es_mx: Correo de verificación enviado. Por favor verifica tu correo electrónico.
fr_fr: E-mail de confirmation envoyé. Veuillez contrôler vos e-mails.
ga_ie: Seoladh r-phost fíoraithe. Seiceáil do ríomhphost.

source: Username
es_mx: Nombre de usuario
fr_fr: Nom d'utilisateur
ga_ie: Ainm Úsáideora

# ACCOUNT_CLICK_LOGIN_LINK
source: Click the login button
es_mx: Haga clic en el botón de inicio de sesión
fr_fr: Cliquez sur le lien de connexion
ga_ie: Cliceáil an cnaipe logála isteach

# ACCOUNT_LOGIN_WITH_AZURE_AD
source: Login with Azure AD
es_mx: Inicie sesión con Azure AD
fr_fr: Se connecter avec Azure AD
ga_ie: Logáil isteach le Azure AD

source: Remember Browser
es_mx: Recordar navegador
fr_fr: Se souvenir du navigateur
ga_ie: Cuimhnigh ar an mBrabhsálaí

source: Yes
es_mx: Si
fr_fr: Oui
ga_ie: Tá

# CONSENT_APPLICATION_ACCESS
source: Application Access
es_mx: Acceso a la aplicación
fr_fr: Accès à l'application
ga_ie: Rochtain Iarratais

# CONSENT_IS_CHECK_UNREQUIRED
source: Uncheck the permissions you do not wish to grant.
es_mx: Desmarca los permisos que no deseas otorgar.
fr_fr: Choisissez l'autorisation que vous ne voulez pas donner.
ga_ie: Díthiceáil na ceadanna nach mian leat a dheonú.

# CONSENT_IS_REQUESTING_YOUR_PERMISSION
source: is requesting your permission
es_mx: esta solicitado tu permiso
fr_fr: Nécessite votre autorisation.
ga_ie: Tá tú ag lorg do chead

# CONSENT_NO_NOT_ALLOWED
source: No, Do Not Allow
es_mx: No, no permitir
fr_fr: Non, ne pas autoriser
ga_ie: Níl

# CONSENT_PERSONAL_INFORMATION
source: Personal Information
es_mx: Información Personal
fr_fr: Informations personnelles
ga_ie: Eolas pearsanta

# CONSENT_REMEMBER_MY_DECISION
source: Remember My Decision
es_mx: Recordar mi decisión
fr_fr: Se souvenir des paramètres
ga_ie: Cuimhnigh Mo Chinneadh

# CONSENT_REQUIRED
source: (required)
es_mx: (requerido)
fr_fr: (champ obligatoire)
ga_ie: (riachtanach)

# CONSENT_YES_ALLOWED
source: Yes, Allow
es_mx: Si, Permitir
fr_fr: Oui, autoriser
ga_ie: Sea, ceadaigh

# LOGOUT_RETURN_TO
source: Return to
es_mx: Volver a
fr_fr: Retour à
ga_ie: Fill ar ais

# WOULD_YOU_LIKE_TO_LOGOUT
source: Would you like to logout of IdentityServer?
es_mx: ¿Desea cerrar sesión en IdentityServer?
fr_fr: Voulez-vous vous déconnecter de IdentityServer ?
ga_ie: Ar mhaith leat logáil isteach de IdentityServer?

# EXTERNAL_LOGINS_ADD_ANOTHER_SERVICE_TO_LOGIN
source: Add another service to log in.
es_mx: Agregue otro servicio para iniciar sesión.
fr_fr: Ajoutez un autre service pour vous connecter
ga_ie: Cuir seirbhís eile le logáil isteach.

source: Language
es_mx: Idioma
fr_fr: Langue
ga_ie: Teanga

# RESET_PASSWORD_CLICK_HERE_TO_LOGIN
source: Click here to log in
es_mx: Haga clic aquí para ingresar
fr_fr: Cliquez ici pour vous connecter
ga_ie: Cliceáil anseo chun logáil isteach

# RESET_PASSWORD_YOUR_PASSWORD_HAS_BEEN_RESET
source: Your password has been reset.
es_mx: Tú contraseña ha sido restablecida.
fr_fr: Votre mot de passe a été réinitialiser
ga_ie: Athshocraíodh do phasfhocal.

source: Send Verification Code
es_mx: Enviar Código de Verificación
fr_fr: Envoyer le code de confirmation
ga_ie: Seol Cód Fíoraithe

# SEND_VERIFICATION_CODE_SELECT
source: Select Two-Factor Authentication Provider:
es_mx: Selecionar el provedor de autenticación de doble factor:
fr_fr: Sélectionnez le fournisseur d'authentification à deux facteurs:
ga_ie: Roghnaigh Soláthraí Fíordheimhniúcháin Dhá-Fachtóir:

source: Unsuccessful login with service.
es_mx: Inicio de sesión fallido con el servicio.
fr_fr: Connexion sans succès avec le service.
ga_ie: Logáil isteach nár éirigh leis le seirbhís.

# CODE_REQUIRED
source: Code is required
es_mx: Se requiere código
fr_fr: Le code est requis.
ga_ie: Tá gá le Cód

source: Invalid code.
es_mx: Código invalido.
fr_fr: Code non valide
ga_ie: Cód neamhbhailí.

# INVALID_CONSENT_PERMISSION
source: You must pick at least one permission.
es_mx: Debes elegir al menos un permiso.
fr_fr: Vous devez sélectionner au moins une autorisation.
ga_ie: Ní mór duit cead amháin ar a laghad a roghnú.

# INVALID_CONSENT_SELECTION
source: Invalid Selection
es_mx: Selección Invalida
fr_fr: Sélection non valide
ga_ie: Roghnú Neamhbhailí

# STATUS_MESSAGE_PROFILE_HAS_BEEN_RESET
source: Your profile has been updated
es_mx: Tú perfil ha sido actualizado
fr_fr: Votre profil a été actualisé
ga_ie: Nuashonraíodh do phróifíl

# ConcurrencyFailure
source: Optimistic concurrency failure, object has been modified.
es_mx: Error de concurrencia optimista, el objeto ha sido modificado.
fr_fr: Échec de la concurrence optimiste, l'objet a été modifié.
ga_ie: Tá teip ar chomhréireacht dóchasach, mionathraíodh an réad.

# DefaultError
source: An unknown failure has occurred.
es_mx: Ha ocurrido una falla desconocida.
fr_fr: Un échec inconnu est survenu.
ga_ie: Tharla teip anaithnid.

# DuplicateEmail
source: Email '{0}' is already taken.
es_mx: El correo electrónico '{0}' esta tomado.
fr_fr: L'e-mail '{0}' est déjà pris.
ga_ie: Tá ríomhphost '{0}' tógtha cheana féin.

# DuplicateRoleName
source: Role name '{0}' is already taken.
es_mx: El nombre de rol '{0}' ya está en uso.
fr_fr: Le nom de rôle '{0}' est déjà pris.
ga_ie: Tá ainm an róil '{0}' tógtha cheana féin.

# DuplicateUserName
source: User name '{0}' is already taken.
es_mx: El nombre de usuario '{0}' ya está en uso.
fr_fr: Le nom d'utilisateur '{0}' est déjà pris.
ga_ie: Tá an t-ainm úsáideora "{0}" tógtha cheana féin.

# InvalidEmail
source: Email '{0}' is invalid.
es_mx: El correo electrónico '{0}' es inválido.
fr_fr: L'email {0}' n'est pas valide.
ga_ie: Tá an ríomhphost '{0}' neamhbhailí.

# InvalidManagerType
source: Type {0} must derive from {1}<{2}>.
es_mx: El tipo {0} debe derivar de {1}<{2}>.
fr_fr: Le type {0} doit provenir de {1} <{2}>.
ga_ie: Ní mór go bhfaigheadh Cineál {0} ó {1} <{2}>.

# InvalidPasswordHasherCompatibilityMode
source: The provided PasswordHasherCompatibilityMode is invalid.
es_mx: El PasswordHasherCompatibilityMode proporcionado no es válido.
fr_fr: Le PasswordHasherCompatibilityMode fourni n'est pas valide.
ga_ie: Tá an PasswordHasherCompatibilityMode atá ar fáil neamhbhailí.

# InvalidPasswordHasherIterationCount
source: The iteration count must be a positive integer.
es_mx: El contador de iteraciones debe ser un número entero positivo.
fr_fr: Le nombre d'itérations doit être un entier positif.
ga_ie: Caithfidh slánuimhir dhearfach a bheith sa chomhaireamh atriallta.

# InvalidRoleName
source: Role name '{0}' is invalid.
es_mx: El nombre del rol '{0}' es inválido.
fr_fr: Le nom de rôle '{0}' n'est pas valide.
ga_ie: Tá ainm róil '{0}' neamhbhailí.

source: Invalid token.
es_mx: Token inválido.
fr_fr: Jeton non valide.
ga_ie: Comhartha neamhbhailí.

# InvalidUserName
source: User name '{0}' is invalid, can only contain letters or digits.
es_mx: El nombre de usuario '{0}' no es válido, solo puede contener letras o dígitos.
fr_fr: Le nom d'utilisateur '{0}' n'est pas valide, il ne peut contenir que des lettres ou des chiffres.
ga_ie: Tá ainm úsáideora '{0}' neamhbhailí, ní féidir ach litreacha nó digití a bheith ann.

# LoginAlreadyAssociated
source: A user with this login already exists.
es_mx: Ya existe un usuario con este inicio de sesión.
fr_fr: Un utilisateur avec cette connexion existe déjà.
ga_ie: Tá úsáideoir leis an logáil seo ann cheana féin.

# MustCallAddIdentity
source: AddIdentity must be called on the service collection.
es_mx: AddIdentity debe invocars en la colección de servicios.
fr_fr: AddIdentity doit être appelé pour la Collection Service.
ga_ie: Ní mór an tsuimiúlacht a ghlaoch ar bhailiúchán na seirbhíse.

# NoPersonalDataProtector
source: No IPersonalDataProtector service was registered, this is required when ProtectPersonalData = true.
es_mx: No se registró ningún servicio IPersonalDataProtector, esto es necesario cuando ProtectPersonalData = true.
fr_fr: Aucun service IPersonalDataProtector n'a été enregistré. Cette opération est requise lorsque ProtectPersonalData = true.
ga_ie: Níor cláraíodh aon seirbhís IPersonalDataProtector, tá sé seo ag teastáil nuair atá ProtectPersonalData = fíor.

# NoRoleType
source: No RoleType was specified, try AddRoles<TRole>().
es_mx: No se especificó RoleType, intente AddRoles<TRole>().
fr_fr: Aucun type de rôle n'a été spécifié, essayez AddRoles <TRole> ().
ga_ie: Níor sonraíodh aon RoleType, bain triail as AddRoles <TRole> ().

# NoTokenProvider
source: No IUserTwoFactorTokenProvider<{0}> named '{1}' is registered.
es_mx: No se ha registrado ningún IUserTwoFactorTokenProvider<{0}> llamado '{1}'.
fr_fr: Aucun IUserTwoFactorTokenProvider <{0}> nommé '{1}' n'est enregistré.
ga_ie: Níl IUserTwoFactorTokenProvider <<0}> ainmnithe '{1}' cláraithe.

# NullSecurityStamp
source: User security stamp cannot be null.
es_mx: El sello de seguridad del usuario no puede ser nulo.
fr_fr: Le timbre de sécurité de l'utilisateur ne peut pas être zéro.
ga_ie: Ní féidir le stampa slándála úsáideora a bheith ar neamhní.

# PasswordMismatch
source: Incorrect password.
es_mx: Contraseña incorrecta
fr_fr: Mot de passe incorrect
ga_ie: Pasfhocal mícheart.

# PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9').
es_mx: Las contraseñas deben tener al menos un dígito ('0' - '9').
fr_fr: Les mots de passe doivent comporter au moins un chiffre ('0' - '9').
ga_ie: Ní mór go mbeadh digit amháin ar a laghad ag pasfhocail ('0' - '9').

# PasswordRequiresLower
source: Passwords must have at least one lowercase ('a'-'z').
es_mx: Las contraseñas deben tener al menos una minúscula ('a' - 'z').
fr_fr: Les mots de passe doivent comporter au moins une minuscule ('a' - 'z').
ga_ie: Ní mór pasfhocail amháin ar a laghad a bheith ag pasfhocail ('a' - 'z').

# PasswordRequiresUniqueChars
source: Passwords must use at least {0} different characters.
es_mx: Las contraseñas deben usar al menos {0} caracteres diferentes.
fr_fr: Les mots de passe doivent utiliser au moins {0} caractères différents.
ga_ie: Ní mór pasfhocail {0} carachtar éagsúil a úsáid.

# PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
es_mx: Las contraseñas deben tener al menos una mayúscula ('A' - 'Z').
fr_fr: Les mots de passe doivent avoir au moins une majuscule ('A' - 'Z').
ga_ie: Caithfidh uasteorainn amháin ar a laghad a bheith ag pasfhocail ('A' - 'Z').

# PasswordTooShort
source: Passwords must be at least {0} characters.
es_mx: Las contraseñas deben tener al menos {0} caracteres.
fr_fr: Les mots de passe doivent comporter au moins {0} caractères.
ga_ie: Caithfidh pasfhocail {0} carachtar a bheith ar a laghad.

source: Recovery code redemption failed.
es_mx: Error al canjear el código de recuperación.
fr_fr: L'utilisation du code de récupération a échoué.
ga_ie: Theip ar fhuascailt an chóid aisghabhála.

# RoleNotFound
source: Role {0} does not exist.
es_mx: El rol {0} no existe.
fr_fr: Le rôle {0} n'existe pas.
ga_ie: Níl ról {0} ann.

# StoreNotIProtectedUserStore
source: Store does not implement IProtectedUserStore<TUser> which is required when ProtectPersonalData = true.
es_mx: El almacén no implementa IProtectedUserStore<TUser> que es requerido cuando ProtectPersonalData = true.
fr_fr: Store n'implémente pas IProtectedUserStore <TUser>, qui est requis lorsque ProtectPersonalData = true.
ga_ie: Ní chuireann Store i bhfeidhm <TUser> IProtectedUserStore atá ag teastáil nuair atá ProtectPersonalData = fíor.

# StoreNotIQueryableRoleStore
source: Store does not implement IQueryableRoleStore<TRole>.
es_mx: El almacén no implementa IQueryableRoleStore<TRole>.
fr_fr: Store n'implémente pas <TRole> IQueryableRoleStore.
ga_ie: Ní chuireann an siopa ITReryableRoleStore <TRole> i bhfeidhm.

# StoreNotIQueryableUserStore
source: Store does not implement IQueryableUserStore<TUser>.
es_mx: El almacén no implementa IQueryableUserStore<TUser>.
fr_fr: Store n'implémente pas IQueryableUserStore <TUser>.
ga_ie: Ní fheidhmíonn Store IQueryableUserStore<TRole>.

# StoreNotIRoleClaimStore
source: Store does not implement IRoleClaimStore<TRole>.
es_mx: El almacén no implementa IRoleClaimStore<TRole>.
fr_fr: Store n'implémente pas IRoleClaimStore <TRole>.
ga_ie: Ní fheidhmíonn Store IQueryableUserStore<TUser>.

# StoreNotIUserAuthenticationTokenStore
source: Store does not implement IUserAuthenticationTokenStore<User>.
es_mx: El almacén no implementa IUserAuthenticationTokenStore<User>.
fr_fr: Store n'implémente pas IUserAuthenticationTokenStore <Utilisateur>.
ga_ie: Ní fheidhmíonn Store IUserAuthenticationTokenStore<User>.

# StoreNotIUserAuthenticatorKeyStore
source: Store does not implement IUserAuthenticatorKeyStore<User>.
es_mx: El almacén no implementa IUserAuthenticatorKeyStore<User>.
fr_fr: Store n'implémente pas IUserAuthenticatorKeyStore <Utilisateur>.
ga_ie: Ní fheidhmíonn Store IUserAuthenticatorKeyStore<User>.

# StoreNotIUserClaimStore
source: Store does not implement IUserClaimStore<TUser>.
es_mx: El almacén no implementa IUserClaimStore<TUser>.
fr_fr: Store n'implémente pas IUserClaimStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserClaimStore<TUser>.

# StoreNotIUserConfirmationStore
source: Store does not implement IUserConfirmationStore<TUser>.
es_mx: El almacén no implementa IUserConfirmationStore<TUser>.
fr_fr: Store n'implémente pas IUserConfirmationStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserConfirmationStore<TUser>.

# StoreNotIUserEmailStore
source: Store does not implement IUserEmailStore<TUser>.
es_mx: El almacén no implementa IUserEmailStore<TUser>.
fr_fr: Store n'implémente pas IUserEmailStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserEmailStore<TUser>.

# StoreNotIUserLockoutStore
source: Store does not implement IUserLockoutStore<TUser>.
es_mx: El almacén no implementa IUserLockoutStore<TUser>.
fr_fr: Store n'implémente pas IUserLockoutStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserLockoutStore<TUser>.

# StoreNotIUserLoginStore
source: Store does not implement IUserLoginStore<TUser>.
es_mx: El almacén no implementa IUserLoginStore<TUser>.
fr_fr: Store n'implémente pas IUserLoginStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserLoginStore<TUser>.

# StoreNotIUserPasswordStore
source: Store does not implement IUserPasswordStore<TUser>.
es_mx: El almacén no implementa IUserPasswordStore<TUser>.
fr_fr: Store n'implémente pas IUserPasswordStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserPasswordStore<TUser>.

# StoreNotIUserPhoneNumberStore
source: Store does not implement IUserPhoneNumberStore<TUser>.
es_mx: El almacén no implementa IUserPhoneNumberStore<TUser>.
fr_fr: Store n'implémente pas IUserPhoneNumberStore <TUser>.
ga_ie: Ní fheidhmíonn Store IUserPhoneNumberStore<TUser>.
