Repository: damienbod/AspNetCoreID4External
Catalog: src/IdentityServerWithAspNetIdentity/Resources/SharedResource.*.resx
Languages: es_mx, fr_fr, ga_ie

source: Password
es_mx: Contraseña
fr_fr: Mot de passe
ga_ie: Pasfhocal

source: Register
es_mx: Registrar
fr_fr: S'inscrire
ga_ie: Cláraigh

source: Confirm Password
es_mx: Confirmar Contraseña
fr_fr: Confirmer le mot de passe
ga_ie: Deimhnigh Pasfhocal

# CONFIRM_PASSWORD_NOT_MATCHING
source: The password and confirmation password do not match.
es_mx: La contraseña y su confirmación no coinciden.
fr_fr: Le mot de passe et la confirmation du mot de passe ne correspondent pas.
ga_ie: Ní mheaitseálann an focal faire agus an pasfhocal deimhnithe.

source: Create a new account.
es_mx: Crear una nueva cuenta.
fr_fr: Créer un nouveau compte
ga_ie: Cruthaigh cuntas nua.

source: E-Mail
es_mx: Correo electrónico
ga_ie: R-Phost

# EMAIL_INVALID
source: invalid Email
es_mx: correo electrónico invalido
fr_fr: Adresse e-mail non valide
ga_ie: Ríomhphost neamhbhailí

source: Password required
es_mx: La contraseña es requirida
fr_fr: Mot de passe requis
ga_ie: Teastaíonn an pasfhocal

source: Reset
es_mx: Restablecer
fr_fr: Réinitialiser
ga_ie: Athshocraigh

source: Reset Password
es_mx: Restablecer la contraseña
fr_fr: Réinitialiser le mot de passe
ga_ie: Athshocraigh an Pasfhocal

source: Reset your password
es_mx: Restablecer tú contraseña
fr_fr: Réinitialisez votre mot de passe
ga_ie: Athshocraigh do phasfhocal

source: Logout
es_mx: Salir
fr_fr: Se déconnecter
ga_ie: Logáil Amach

source: Remember me
es_mx: Recordarme
fr_fr: Se souvenir du login
ga_ie: Cuimhnigh orm

source: Forgot your password?
es_mx: ¿Olvidaste tú contraseña?
fr_fr: Mot de passe oublié
ga_ie: Ar rinne tú dearmad ar do Phásfhocail?

# ACCOUNT_LOGIN
source: Log in
es_mx: Iniciar sesión
fr_fr: Se connecter
ga_ie: Logáil isteach

# REGISTER_AS_NEW_USER
source: Register as a new user
es_mx: Registrar como usuario nuevo
fr_fr: S'inscrire en tant que nouvel/le utilisateur/trice
ga_ie: Cláraigh mar úsáideoir nua

source: Access denied
es_mx: Acceso denegado
fr_fr: Accès refusé
ga_ie: Rochtain diúltaithe

# ACCESS_DENIED_TEXT
source: You do not have access to this resource.
es_mx: No tienes acceso a este recurso.
fr_fr: Vous n'avez pas accès à cette ressource.
ga_ie: Níl rochtain agat ar an acmhainn seo.

# ACCOUNT_NO_EXTERNAL_LOGINS
source: There are no external authentication services configured. See this article https://go.microsoft.com/fwlink/?LinkID=532715 for details on setting up this ASP.NET application to support logging in via external services.
es_mx: No hay ningún servicio de autenticación configurado. Ver el artículo https://go.microsoft.com/fwlink/?LinkID=53215 para más detalles sobre como configurar esto en una aplicación ASP.NET
fr_fr: Aucun service d'authentification externe n'est configuré. Pour plus d'informations concernant la configuration de cette application ASP.NET pour vous connecter à des services externes, consultez cet article sur le lien: https://go.microsoft.com/fwlink/?LinkID=532715.
ga_ie: Níl aon seirbhísí fíordheimhnithe seachtracha cumraithe. Féach an t-alt seo https://go.microsoft.com/fwlink/?LinkID=532715 le haghaidh sonraí maidir leis an bhfeidhmchlár ASP.NET seo a chur ar bun chun tacú le logáil isteach trí sheirbhísí seachtracha.

# ACCOUNT_USE_ANOTHER_SERVICE_LOG_IN
source: Use another service to log in.
es_mx: Usar otro servicio para iniciar sesión
fr_fr: Utilisez un autre service pour vous connecter.
ga_ie: Bain úsáid as seirbhís eile chun logáil isteach.

# ACCOUNT_USE_LOCAL_ACCOUNT_TO_LOG_IN
source: Use a local account to log in.
es_mx: Usa una cuenta local para ingresar.
fr_fr: Utilisez un utilisateur local pour vous connecter.
ga_ie: Bain úsáid as cuntas áitiúil le logáil isteach.

source: Confirm email
es_mx: Confirmar correo electrónico
fr_fr: Confirmation de l'adresse e-mail
ga_ie: Deimhnigh Ríomhphost

# CONFIRM_EMAIL_TEXT
source: Thank you for confirming your email.
es_mx: Gracias por confirmar tú correo electrónico.
fr_fr: Merci de confirmer votre adresse e-mail.
ga_ie: Go raibh maith agat as do ríomhphost a dhearbhú.

source: Confirm your email
es_mx: Confirma tú correo electrónico
fr_fr: Confirmez votre adresse e-mail.
ga_ie: Deimhnigh do ríomhphost

# CONFIRM_YOUR_EMAIL_TEXT
source: Please confirm your account by <a href='{0}'>clicking here</a>.
es_mx: Por favor confirma tu cuenta <a href='{0}'>presionando aquí</a>.
fr_fr: Veuillez confirmer votre compte en cliquant sur <a href='{0}'> </a>.
ga_ie: Deimhnigh le do thoil do chuntas le <a href='{0}'> cliceáil anseo </a>.

source: Forgot password confirmation
es_mx: Olvidar confirmación de contraseña
fr_fr: Confirmation de mot de passe oubliée
ga_ie: Dearbhú pasfhocal dearmadta

# FORGOT_PASSWORD_CONFIRMATION_TEXT
source: Please check your email to reset your password.
es_mx: Por favor verifica tu correo electrónico para restablecer tú contraseña.
fr_fr: Veuillez vérifier votre adresse e-mail pour réinitialiser votre mot de passe.
ga_ie: Seiceáil do ríomhphost chun do phasfhocal a athshocrú.

# FORGOT_YOUR_PASSWORD_ENTER_EMAIL
source: Enter your email.
es_mx: Ingresa tu correo eléctronico.
fr_fr: Entrer votre adresse e-mail
ga_ie: Cuir isteach do ríomhphost.

source: Invalid login attempt.
es_mx: Intento de inicio inválido.
fr_fr: Tentative de connexion non valide
ga_ie: Iarracht logála neamhbhailí.

source: Locked out
es_mx: Bloqueado
fr_fr: Bloqué
ga_ie: Faoi ghlas

# LOCKED_OUT_TEXT
source: This account has been locked out, please try again later.
es_mx: Esta cuenta ha sido bloqueada, por favor intenta más tarde.
fr_fr: Ce compte a été bloqué. Veuillez réessayer plus tard.
ga_ie: Cuireadh an cuntas seo faoi ghlas, bain triail as arís níos déanaí.

# RESET_PASSWORD_EMAIL_TEXT
source: Please reset your password by <a href='{0}'>clicking here</a>.
es_mx: Por favor restablece tú contraseña presionando <a href='{0}'>aquí</a>.
fr_fr: Veuillez réinitialiser votre mot de passe en <a href='{0}'>cliquant</a> ici.
ga_ie: Déan do phasfhocal a athshocrú le <a href='{0}'> Cliceáil anseo </a>.

source: Submit
es_mx: Enviar
fr_fr: Confirmer
ga_ie: Cuir isteach

# EXTERNAL_LOGIN_ASSOCIATE_ACCOUNT
source: Associate your {0} account
es_mx: Asociar tú cuenta de {0}
fr_fr: Connectez votre compte {0}
ga_ie: Chomhlachú do {0} cuntas

# EXTERNAL_LOGIN_TEXT
source: You've successfully authenticated with {0}. Please enter an email address for this site below and click the Register button to finish logging in.
es_mx: Te has autenticado con éxito con {0}. Ingrese una dirección de correo electrónico para este sitio a continuación y haga clic en el botón Registrarse para finalizar el inicio de sesión.
fr_fr: Vous vous êtes authentifié avec {0} avec succès. Veuillez saisir ci-dessous une adresse e-mail pour cette page et cliquez sur le bouton Enregistrer pour terminer l'inscription.
ga_ie: Tá tú fíordheimhnithe go rathúil le {0}. Cuir isteach seoladh ríomhphoist don suíomh seo thíos agus cliceáil ar an gcnaipe Clár chun logáil isteach a chríochnú.

# EXTERNAL_PROVIDER_ERROR
source: Error from external provider: {0}
es_mx: Error del provedor externo: {0}
fr_fr: Erreur du fournisseur externe: {0}
ga_ie: Earráid ón soláthraí seachtrach: {0}

# EXTERNAL_PROVIDER_ERROR_CONFIRMATION
source: Error loading external login information during confirmation.
es_mx: Error al cargar la información de inicio de sesión externo durante la confirmación.
fr_fr: Erreur lors du chargement des informations de connexion externes pendant la confirmation.
ga_ie: Earráid agus faisnéis logála seachtrach á lódáil le linn an dearbhaithe.

# EXTERNAL_PROVIDER_ERROR_INFO
source: Error loading external login information.
es_mx: Error al cargar la información del inicio de sesión externo.
fr_fr: Erreur lors du chargement des informations de connexion externes.
ga_ie: Earráid agus faisnéis sheachtrach logála isteach á lódáil.

# ACCOUNT_LOGIN_2FA
source: Two-factor authentication
es_mx: Autenticación de doble factor
fr_fr: Authentification à deux facteurs
ga_ie: Fíordheimhniú dhá fhachtóir

# ACCOUNT_LOGIN_2FA_NO_AUTHENTICATOR_DEVICE
source: Don't have access to your authenticator device? You can
es_mx: ¿No tiene acceso a su dispositivo autenticador? Usted puede
fr_fr: Vous ne pouvez pas accéder à votre périphérique d'authentification? Vous pouvez
ga_ie: Ná bíodh rochtain agat ar do ghléas fíordheimhnithe? Is féidir leat

# ACCOUNT_LOGIN_2FA_RECOVERY_CODE_TEXT
source: log in with a recovery code
es_mx: iniciar sesión con un código de recuperación
fr_fr: Se connecter avec un code de récupération
ga_ie: logáil isteach le cód aisghabhála

# ACCOUNT_LOGIN_2FA_REMEMBER_MC
source: Remember this machine
es_mx: Recordar este equipo
fr_fr: Mémoriser l'appareil
ga_ie: Cuimhnigh ar an meaisín seo

# ACCOUNT_LOGIN_2FA_TEXT
source: Your login is protected with an authenticator app. Enter your authenticator code below.
es_mx: Su inicio de sesión está protegido con una aplicación de autenticación. Ingrese su código de autenticación a continuación.
fr_fr: Votre connexion est protégée par une application Authenticator. Entrer votre code d'authentification ci-dessous.
ga_ie: Déantar do logáil isteach a chosaint le app fíoraitheora. Cuir isteach do chód fíordheimhnithe thíos.

# ACCOUNT_LOGIN_AUTHENTICATOR_CODE
source: Authenticator code
es_mx: Código de autenticación
fr_fr: Code d'authentification
ga_ie: Cód fíordheimhnithe

# ACCOUNT_RECOVERY_CODE
source: Recovery code
es_mx: Código de recuperación
fr_fr: Code de récupération
ga_ie: Cód aisghabhála

# ACCOUNT_RECOVERY_CODE_REQUIRED
source: Recovery code required
es_mx: Código de recuperación requerido
fr_fr: Code de récupération requis
ga_ie: Cód aisghabhála ag teastáil

# ACCOUNT_RECOVERY_CODE_VERIFICATION
source: Recovery code verification
es_mx: Verificación del código de recuperación
fr_fr: Vérification du code de récupération
ga_ie: Fíorú an chóid aisghabhála

# ACCOUNT_RECOVERY_CODE_VERIFICATION_TEXT
source: You have requested to log in with a recovery code. This login will not be remembered until you provide an authenticator app code at log in or disable 2FA and log in again.
es_mx: Ha solicitado iniciar sesión con un código de recuperación. Este inicio de sesión no se recordará hasta que proporcione un código de aplicación de autenticación al iniciar sesión o deshabilite 2FA y vuelva a iniciar sesión.
fr_fr: Vous vous êtes connecté avec un code de récupération. Cette connexion ne sera pas enregistrée jusqu'à ce que vous ayez spécifié un code d'application Authenticator lors de la connexion, ou que vous ayez désactivé 2FA et que vous vous reconnectiez.
ga_ie: D'iarr tú ar logáil isteach le cód aisghabhála. Ní chuirfear an logáil seo san áireamh go dtí go soláthróidh tú cód app fíoraitheora ag logáil isteach nó díchumasaigh 2FA agus logáil isteach arís.

source: Invalid authenticator code.
es_mx: Código de autenticación inválido.
fr_fr: Code d'authentification non valide
ga_ie: Cód fíordheimhnithe neamhbhailí.

# INVALID_RECOVERY_CODE
source: Invalid recovery code entered.
es_mx: El código de recuperación ingresado es inválido.
fr_fr: Code de récupération entré non vaide
ga_ie: Cuireadh cód aisghabhála neamhbhailí isteach.

# LOGOUT_TEXT
source: You have successfully logged out of the application.
es_mx: Has cerrado sesión con éxito en la aplicación.
fr_fr: Vous vous êtes déconnecté de l'application avec succès.
ga_ie: D'éirigh leat logáil amach as an iarratas.

source: Reset password confirmation
es_mx: Restablecer confirmación de contraseña
fr_fr: Confirmation de réinitialisation du mot de passe
ga_ie: Athshocraigh pasfhocal

# RESET_PASSWORD_CONFIRMATION_CLICK_HERE
source: click here to log in
es_mx: presiona aquí para ingresar
fr_fr: Cliquez ici pour vous connecter
ga_ie: cliceáil anseo chun logáil isteach

# RESET_PASSWORD_CONFIRMATION_TEXT1
source: Your password has been reset. Please
es_mx: Tú contraseña ha sido restablecida. Por favor
fr_fr: Votre mot de passe a été réinitialiser. S.v.p.
ga_ie: Athshocraíodh do phasfhocal. Le do thoil

source: The {0} must be at least {2} and at max {1} characters long.
es_mx: El {0} debe tener al menos {2} y un máximo de {1} caracteres de longitud.
fr_fr: Le {0} doit contenir au moins {2} et ne doit pas comporter plus de {1} caractères.
ga_ie: Caithfidh an {0} a bheith {2} ar a laghad agus ag max {1} carachtar fada.

# 2FA
source: Two-factor authentication
es_mx: Autenticación de doble factor
fr_fr: Authentification à deux facteurs
ga_ie: Fíordheimhniú dhá fhachtóir

source: Change password
es_mx: Cambiar contraseña
fr_fr: Changer le mot de passe
ga_ie: Athraigh do phasfhocal

# CHANGE_PASSWORD_STATUS
source: Your password has been changed.
es_mx: Tú contraseña ha sido cambiada.
fr_fr: Votre mot de passe a été modifié.
ga_ie: Athraíodh do phasfhocal.

source: Current password
es_mx: Contraseña actual
fr_fr: Mot de passe actuel
ga_ie: Pasfhocal reatha

source: Current password required
es_mx: Contraseña actual requerida
fr_fr: Mot de passe actuel requis
ga_ie: Teastaíonn an pasfhocal reatha

source: External logins
es_mx: Inicios de sesión externos
fr_fr: Connexions externes
ga_ie: Logáin sheachtracha

# MANAGE_CHANGE_ACCOUNT_SETTINGS
source: Change your account settings
es_mx: Cambiar la configuración de su cuenta
fr_fr: Modifier vos paramètres d'utilisateur
ga_ie: Athraigh socruithe do chuntais

source: Manage your account
es_mx: Administar tú cuenta
fr_fr: Modifier vos paramètres d'utilisateur
ga_ie: Bainistigh do chuntas

source: New password
es_mx: Nueva contraseña
fr_fr: Nouveau mot de passe
ga_ie: Focal Faire Nua

source: New password required
es_mx: La nueva contraseña es requerida
fr_fr: Nouveau mot de passe requis
ga_ie: Teastaíonn pasfhocal nua

source: Personal data
es_mx: Información personal
fr_fr: Données personnelles
ga_ie: Sonraí pearsanta

source: Profile
es_mx: Perfil
fr_fr: Profil
ga_ie: Próifíl

# TWOFACTORCODE_REQUIRED
source: Two-factor code is required
es_mx: Se requiere un código de doble factor
fr_fr: Le code à deux facteurs est requis.
ga_ie: Tá gá le cód dhá fhachtóir

source: Update password
es_mx: Actualizar contraseña
fr_fr: Actualiser le mot de passe
ga_ie: Nuashonraigh an focal faire

# VERIFICATION_CODE_REQUIRED
source: Verification code is required
es_mx: El código de verificación es requerido
fr_fr: Le code de confirmation est requis
ga_ie: Tá cód fíoraithe ag teastáil

source: and
es_mx: y
fr_fr: et
ga_ie: agus

source: Configure authenticator app
es_mx: Configurar la aplicación de autenticación
fr_fr: Configurez l'application Authenticator
ga_ie: Cum an feidhmchlár fíordheimhnithe

# CONFIGURE_AUTHENTICATOR_APP_DOWNLOAD_TEXT
source: Download a two-factor authenticator app like Microsoft Authenticator for
es_mx: Descargue una aplicación de autenticación de dos factores como Microsoft Authenticator para
fr_fr: Téléchargez une application d'authentification à deux facteurs comme Microsoft Authenticator pour
ga_ie: Íoslódáil app fíordheimhnithe dhá fhachtóir ar nós Microsoft Authenticator do

# CONFIGURE_AUTHENTICATOR_APP_GOOGLE_TEXT
source: Google Authenticator for
es_mx: Autenticador de Google para
fr_fr: Google Authenticator pour
ga_ie: Google Authenticator do

# CONFIGURE_AUTHENTICATOR_APP_SCAN1
source: Scan the QR Code or enter this key
es_mx: Escanee el código QR o ingrese esta clave
fr_fr: Scannez le code QR ou entrez cette clé.
ga_ie: Scan an Cód QR nó cuir isteach an eochair seo

# CONFIGURE_AUTHENTICATOR_APP_SCAN2
source: into your two factor authenticator app. Spaces and casing do not matter.
es_mx: en su aplicación de autenticación de dos factores. Los espacios y la carcasa no importan.
fr_fr: dans votre application d'authentification à deux facteurs. Les espaces, les majuscules et les minuscules n'ont pas d'importance.
ga_ie: isteach i do app fíordheimhnithe dhá fhachtóir. Ní ábhar spáis ná cásáil iad.

# CONFIGURE_AUTHENTICATOR_APP_SCAN_ALERT
source: To enable QR code generation please read our
es_mx: Para habilitar la generación de código QR, lea nuestra
fr_fr: Pour activer la génération de code QR, veuillez lire notre
ga_ie: Le go n-éascófar giniúint cóid QR léigh ár n-eolas le do thoil

# CONFIGURE_AUTHENTICATOR_APP_SCAN_ALERT_DETAILS
source: Once you have scanned the QR code or input the key above, your two factor authentication app will provide you with a unique code. Enter the code in the confirmation box below.
es_mx: Una vez que haya escaneado el código QR o ingrese la clave anterior, su aplicación de autenticación de dos factores le proporcionará un código único. Ingrese el código en el cuadro de confirmación a continuación.
fr_fr: Après avoir scanné le code QR ou entré la clé ci-dessus, l'application d'authentification à deux facteurs vous donnera un code unique. Entrez le code dans le champ de confirmation.
ga_ie: Nuair a bheidh an cód QR scanta agat nó nuair a ionchorpraíonn tú an eochair thuas, cuirfidh do app fíordheimhnithe dhá fhachtóir cód uathúil ar fáil duit. Cuir isteach an cód sa bhosca dearbhaithe thíos.

# CONFIGURE_AUTHENTICATOR_APP_SCAN_ALERT_LINK
source: documentation
es_mx: documentación
ga_ie: doiciméadú

# CONFIGURE_AUTHENTICATOR_APP_STEPS
source: To use an authenticator app go through the following steps:
es_mx: Para usar una aplicación de autenticación, siga los siguientes pasos:
fr_fr: Suivez ces étapes pour utiliser une application Authenticator:
ga_ie: Chun feidhm a bhaint as app fíordheimhnithe téigh trí na céimeanna seo a leanas:

source: Delete Personal Data
es_mx: Eliminar datos personales
fr_fr: Effacez les données personnelles
ga_ie: Scrios Sonraí Pearsanta

# DELETE_PERSONAL_DATA_AND_CLOSE
source: Delete data and close my account
es_mx: Eliminar datos y cerrar mi cuenta
fr_fr: Effacez les données et fermez mon compte
ga_ie: Scrios na sonraí agus dún mo chuntas

# DELETE_PERSONAL_DATA_TEXT
source: Deleting this data will permanently remove your account, and this cannot be recovered.
es_mx: Eliminar estos datos eliminará permanentemente su cuenta, y esto no se puede recuperar.
fr_fr: La suppression de ces données entraînera la suppression définitive de votre compte. Cela ne peut pas être restauré.
ga_ie: Má scriostar na sonraí seo bainfear do chuntas go buan agus ní féidir é seo a aisghabháil.

# DISABLE_2FA
source: Disable two-factor authentication (2FA)
es_mx: Deshabilitar la autenticación de doble factor (2FA)
fr_fr: Désactivez l'authentification à deux facteurs (2FA)
ga_ie: Díchumasaigh fíordheimhniú dhá fhachtóir (2FA)

# DISABLE_2FA_BUTTON
source: Disable 2FA
es_mx: Desabilitar 2FA
fr_fr: Désactivez 2FA
ga_ie: Díchumasaigh 2FA

# DISABLE_2FA_STATUS
source: 2fa has been disabled. You can reenable 2fa when you setup an authenticator app
es_mx: 2fa se ha deshabilitado. Puede volver a habilitar 2fa cuando configure una aplicación de autenticación
fr_fr: 2FA a été désactivée. Vous pouvez activer 2FA lorsque vous configurez une application Authenticator.
ga_ie: Díchumasaíodh 2FA. Is féidir leat 2FA a chumasú nuair a chuireann tú app fíoraitheora ar bun

# DISABLE_2FA_TEXT_DETAILS
source: Disabling 2FA does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
es_mx: Deshabilitar 2FA no cambia las claves utilizadas en las aplicaciones de autenticación. Si desea cambiar la clave utilizada en una aplicación de autenticación, debe
fr_fr: La désactivation de 2FA ne modifie pas les clés utilisées dans les applications Authenticator. Si vous souhaitez modifier la clé utilisée dans une application Authenticator, vous devez utiliser votre clé d'authentification.
ga_ie: Ní athraíonn an 2FA na heochracha a úsáidtear in aipeanna fíordheimhnithe. Más mian leat an eochair a athrú i app fíoraitheora ba chóir duit

# DISABLE_2FA_TEXT_DETAILS_LINK
source: reset your authenticator keys.
es_mx: restablecer sus claves de autenticación.
fr_fr: Réinitialiser
ga_ie: do chuid eochracha fíordheimhnithe a athshocrú.

# DISABLE_2FA_TEXT_HEADER
source: This action only disables 2FA.
es_mx: Está acción solo desactiva 2FA.
fr_fr: Cette action désactive seulement 2FA.
ga_ie: Ní dhíchumasaíonn an gníomh seo ach 2FA.

source: Download Your Data
es_mx: Descagar tus datos
fr_fr: Téléchargez vos données.
ga_ie: Íoslódáil Do shonraí

# INCORRECT_PASSWORD
source: Password is not correct
es_mx: Contraseña incorrecta
fr_fr: Le mot de passe n'est pas correct
ga_ie: Níl an focal faire ceart

# INVALID_VERFICATION_CODE
source: Verification code is invalid.
es_mx: El código de verificación es inválido.
fr_fr: Le code de vérification n'est pas valide
ga_ie: Tá an cód fíoraithe neamhbhailí.

source: or
es_mx: o
fr_fr: ou
ga_ie: nó

# USER_NOTFOUND
source: Unable to load user with ID '{0}'.
es_mx: No fue posible cargar al usuario con '{0}'.
fr_fr: L'utilisateur n'a pas pu être chargé avec l'ID '{0}'.
ga_ie: Ní féidir an t-úsáideoir a luchtú le ID '{0}'.

source: Verification code
es_mx: Código de verificación
fr_fr: Code de confirmation
ga_ie: Cód fíorúcháin

source: Verify
es_mx: Verificar
fr_fr: Contrôler
ga_ie: Fíoraigh

# 2FA_AUTHENTICATION_ADD_AUTHENTICATOR_APP
source: Add authenticator app
es_mx: Agregar aplicación de autenticación
fr_fr: Ajoutez l'application d'authentification
ga_ie: Cuir app fíoraitheora leis

# 2FA_AUTHENTICATION_ADD_RESET_APP
source: Reset authenticator app
es_mx: Restablecer aplicación de autenticación
fr_fr: Réinitialiser l'application Authenticator
ga_ie: Athshocraigh app fíordheimhnithe

# 2FA_AUTHENTICATION_ADD_SETUP_APP
source: Setup authenticator app
es_mx: Configurar la aplicación de autenticación
fr_fr: Agencer l'application d'authentification
ga_ie: Aip fíordheimhnithe socraithe

# 2FA_AUTHENTICATION_TITLE
source: Two-factor authentication (2FA)
es_mx: Autenticación de dos factores (2FA)
fr_fr: Authentification à deux facteurs (2FA)
ga_ie: Fíordheimhniú dhá fhachtóir (2FA)

# 2FA_NO_CODES_LEFT
source: You have no recovery codes left.
es_mx: No te quedan códigos de recuperación.
fr_fr: Vous n'avez plus de codes de récupération.
ga_ie: Níl aon chód aisghabhála fágtha agat.

# 2FA_NO_CODES_LEFT_TEXT
source: You must generate a new set of recovery codes before you can log in with a recovery code.
es_mx: Debe generar un nuevo conjunto de códigos de recuperación antes de poder iniciar sesión con un código de recuperación.
fr_fr: Vous devez générer un nouvel ensemble de codes de récupération avant de pouvoir vous connecter avec un code de récupération.
ga_ie: Ní mór duit tacar nua cód aisghabhála a ghiniúint sular féidir leat logáil isteach le cód aisghabhála.

# 2FA_N_CODES_LEFT
source: You have {0} recovery codes left.
es_mx: Te quedan {0} códigos de recuperación.
fr_fr: Il vous reste {0} code(s) de récupération.
ga_ie: Tá {0} cód aisghabhála fágtha agat.

# 2FA_N_CODES_LEFT_TEXT
source: You should generate a new set of recovery codes.
es_mx: Debe generar un nuevo conjunto de códigos de recuperación.
fr_fr: Il vous faut générer une nouvelle série de codes de récupération.
ga_ie: Ba chóir duit tacar nua cód aisghabhála a ghiniúint.

# 2FA_ONE_CODES_LEFT
source: You have 1 recovery code left.
es_mx: Te queda 1 código de recuperación.
fr_fr: Il vous reste 1 code de récupération.
ga_ie: Tá 1 cód téarnaimh fágtha agat.

# 2FA_ONE_CODES_LEFT_TEXT
source: You can generate a new set of recovery codes.
es_mx: Puede generar un nuevo conjunto de códigos de recuperación.
fr_fr: Vous pouvez générer un nouvel ensemble de codes de récupération.
ga_ie: Is féidir leat tacar nua cód aisghabhála a ghiniúint.
